{
  "CONTACT": {
    "EMAIL_PLACEHOLDER": "Your email",
    "MESSAGE_ERROR": "There was an error sending your message",
    "MESSAGE_ME": "Message Me",
    "MESSAGE_PLACEHOLDER": "Say something nice, or at least interesting…",
    "MESSAGE_SUCCESS": "Thanks for the message",
    "NAME_PLACEHOLDER": "Your name",
    "SEND": "Send"
  },
  "DAYS_OFF": {
    "MAIN": {
      "BACK_TO": "Back to",
      "EXPLANATION_1": "Use the calendar to schedule your days off work. 7 days off have already been scheduled for you.",
      "EXPLANATION_2": "Clicking on a currently scheduled day will turn it red as it will be canceled. You can select or deselect any other date to schedule new days off.",
      "EXPLANATION_3": "Click SAVE to update your schedule.",
      "SAVE": "Save",
      "TITLE": "Schedule Your Days Off Work (example app)",
      "UPDATE_ERROR": "Error updating days off",
      "UPDATE_SUCCESS": "Days off updated"
    },
    "MANAGEMENT": {
      "CLEAR_ALL_DATES": "Clear All Dates",
      "CLEAR_MONTH": "Clear Month",
      "NO_DATES_SAVED": "No Dates Saved",
      "RESTORE_ALL": "Restore All",
      "SAVED_DAYS_OFF": "Saved Days Off",
      "SELECT_DATE_EXPLANATION": "Select a date from the calendar and click the save button.",
      "SELECT_MONTH": "Select Entire Month",
      "SELECT_YEAR": "Select Entire Year",
      "SLOTS_DELETE_ALL": "Delete All",
      "TODAY": "Go To Today"
    }
  },
  "EXPLANATIONS": {
    "BOX_1": "This app demonstrates how an employee can schedule their days off from work. In this example the office is closed during the weekend. The employee already has several days off scheduled. By clicking dates on the calendar you can add or remove as many as 365 days off at a time.",
    "BOX_2": "The app is fully mobile responsive. It supports multiple languages and can switch on the fly. Because this is a demonstration, all default data is mocked and does not communicate with an API. CRUD actions do work as expected but are lost if the page is refreshed.",
    "BOX_3": "The codebase is built on Angular 14. The calendar is a heavily customized version of a PrimeNG component. Other PrimeNG UI components are used as well. The bare bones CSS framework is based on Skeleton. The app codebase is available on GitHub.",
    "BOX_4": "The app is based on my code from a previous job. It is somewhat over-engineered to show off various technologies. If you have any questions, suggestions, or (horror) find a bug feel free to message me."
  },
  "MENU": {
    "APP_EXPLANATION": "How the app works",
    "DARK_MODE": "Switch to dark mode",
    "GITHUB_CODE": "See the code on Github",
    "LIGHT_MODE": "Switch to light mode",
    "SELECT_LANGUAGE": "Select a language",
    "SEND_MESSAGE": "Send me a message"
  },
  "PRIMENG": {
    "dayNamesMin": [
      "S",
      "M",
      "T",
      "W",
      "T",
      "F",
      "S"
    ]
  }
}
