{
  "CONTACT": {
    "EMAIL_PLACEHOLDER": "Tu e-mail",
    "MESSAGE_ERROR": "Hubo un error al enviar su mensaje",
    "MESSAGE_ME": "Mensajeame",
    "MESSAGE_PLACEHOLDER": "Di algo agradable, o al menos interesante…",
    "MESSAGE_SUCCESS": "Gracias por el mensaje",
    "NAME_PLACEHOLDER": "Tu nombre",
    "SEND": "Enviar"
  },
  "DAYS_OFF": {
    "MAIN": {
      "BACK_TO": "De vuelta a",
      "EXPLANATION_1": "Utilice el calendario para programar sus días de descanso. Ya se han programado 7 días libres para usted.",
      "EXPLANATION_2": "Al hacer clic en un día programado actualmente, se volverá rojo ya que se cancelará. Puede seleccionar o deseleccionar cualquier otra fecha para programar nuevos días libres.",
      "EXPLANATION_3": "Haz clic en GUARDAR para actualizar tu horario.",
      "SAVE": "Guardar",
      "TITLE": "Programe sus días libres de trabajo (aplicación de ejemplo)",
      "UPDATE_ERROR": "Error al actualizar los días libres",
      "UPDATE_SUCCESS": "Días libres actualizados"
    },
    "MANAGEMENT": {
      "CLEAR_ALL_DATES": "Borrar todas las fechas",
      "CLEAR_MONTH": "Borrar mes",
      "NO_DATES_SAVED": "No se guardaron fechas",
      "RESTORE_ALL_QUESTION": "Restaurar todo",
      "SAVED_DAYS_OFF": "Días libres guardados",
      "SELECT_DATE_EXPLANATION": "Seleccione una fecha del calendario y haga clic en el botón Guardar.",
      "SELECT_MONTH": "Seleccionar mes",
      "SELECT_YEAR": "Seleccionar año",
      "SLOTS_DELETE_ALL": "Borre todo",
      "TODAY": "Ir a hoy"
    }
  },
  "EXPLANATIONS": {
    "BOX_1": "Esta aplicación demuestra cómo un empleado puede programar sus días libres del trabajo. En este ejemplo, la oficina está cerrada durante el fin de semana. El empleado ya tiene varios días libres programados. Al hacer clic en las fechas en el calendario, puede agregar o eliminar hasta 365 días libres a la vez.",
    "BOX_2": "La aplicación es totalmente móvil. Es compatible con varios idiomas y puede cambiar sobre la marcha. Debido a que se trata de una demostración, todos los datos predeterminados se simulan y no se comunican con una API. Las acciones CRUD funcionan como se esperaba, pero se pierden si se actualiza la página.",
    "BOX_3": "El código base se basa en Angular 18. El calendario es una versión muy personalizada de un componente PrimeNG. También se utilizan otros componentes de la interfaz de usuario de PrimeNG. El marco CSS básico se basa en Skeleton. El código base de la aplicación está disponible en GitHub.",
    "BOX_4": "La aplicación se basa en mi código de un trabajo anterior. Está algo sobre-diseñado para mostrar varias tecnologías. Si tiene alguna pregunta, sugerencia o (horror) encuentra un error, no dude en enviarme un mensaje."
  },
  "MENU": {
    "APP_EXPLANATION": "Cómo funciona la aplicación",
    "DARK_MODE": "Cambiar al modo oscuro",
    "GITHUB_CODE": "Ver el código en Github",
    "LIGHT_MODE": "Cambiar al modo de luz",
    "SELECT_LANGUAGE": "Error al actualizar los días libres",
    "SEND_MESSAGE": "Envíeme un mensaje"
  },
  "PRIMENG": {
    "dayNamesMin": [
      "D",
      "L",
      "M",
      "X",
      "J",
      "V",
      "S"
    ]
  }
}
